---
kind: other
id: Properties.T:Autodesk.Revit.DB.Electrical.CableTraySettings
source: html/2725032c-21c0-9c23-98ed-e5fc6f278e56.htm
---
# CableTraySettings Properties

The id of the assembly instance to which the element belongs.